In [3]:
#cbind and rbind
df = data.frame(name=c("a","b","c","d","e"),
                sex=c("M","F","F","M","O"),
                id=c(1,2,3,4,5)
               )

In [4]:
df

  name sex id
1 a    M   1
2 b    F   2
3 c    F   3
4 d    M   4
5 e    O   5

In [5]:
age = c(18,24,23,18,19)

In [6]:
age

[1] 18 24 23 18 19

In [7]:
df

  name sex id
1 a    M   1
2 b    F   2
3 c    F   3
4 d    M   4
5 e    O   5

In [8]:
df1 = cbind(df,age)

In [9]:
df1

  name sex id age
1 a    M   1  18
2 b    F   2  24
3 c    F   3  23
4 d    M   4  18
5 e    O   5  19

In [10]:
df2 = data.frame(name=c("x","y","Z"),sex=c("M","F","F"),
                id=c(1,2,3),age=c(18,19,20))

In [11]:
df1

  name sex id age
1 a    M   1  18
2 b    F   2  24
3 c    F   3  23
4 d    M   4  18
5 e    O   5  19

In [12]:
df2

  name sex id age
1 x    M   1  18
2 y    F   2  19
3 Z    F   3  20

In [14]:
#rbind
df3 = rbind(df1,df2)

In [15]:
df3

  name sex id age
1 a    M   1  18
2 b    F   2  24
3 c    F   3  23
4 d    M   4  18
5 e    O   5  19
6 x    M   1  18
7 y    F   2  19
8 Z    F   3  20

In [17]:
football = data.frame(id=c(1001,1005,1101,1021,1003),
position=c('center','forward','goal keeper','defender','goal keeper') )

In [18]:
football

  id   position
1 1001 center
2 1005 forward
3 1101 goal keeper
4 1021 defender
5 1003 goal keeper

In [19]:
cricket = data.frame(id=c(1101,1002,1004,1021,1008),
    type=c("Batsman","All rounder","spin Bowler","Keeper","fast bowler"))

In [20]:
cricket

  id   type
1 1101 Batsman
2 1002 All rounder
3 1004 spin Bowler
4 1021 Keeper
5 1008 fast bowler

In [22]:
df = merge(x=football,y=cricket,by.x="id",by.y="id")

In [23]:
df

  id   position    type
1 1021 defender    Keeper
2 1101 goal keeper Batsman

In [24]:
getwd()

[1] "C:/Users/Sachin/Desktop/Winter_INTERN_BATCH_2018/DataScience/R"

In [25]:
s_data = read.csv('student_data.csv',header = T)
s_marks = read.csv('student_marks.csv',header = T)

In [26]:
s_data

  sid name      age ph_no
1 1   manish    18  1238912985
2 2   poonam    21  1238998993
3 3   rajat     33  1823928312
4 4   preyanshu 18   123343212
5 5   simran    19  1281292312
6 6   ravi      34  1234543212

In [27]:
s_marks

  sid marks1 marks2 marks3
1 1   56     76     34
2 2   74     67     56
3 3   56     67     43
4 4   67     45     34
5 5   NA     NA     NA
6 6   35     67     NA

In [32]:
total_data = merge(s_data,s_marks,by='sid')

In [34]:
total_data

  sid name      age ph_no      marks1 marks2 marks3
1 1   manish    18  1238912985 56     76     34
2 2   poonam    21  1238998993 74     67     56
3 3   rajat     33  1823928312 56     67     43
4 4   preyanshu 18   123343212 67     45     34
5 5   simran    19  1281292312 NA     NA     NA
6 6   ravi      34  1234543212 35     67     NA